ARMmbed/DAPLink/source/hic_hal/toshiba/tmpm366/driver/src/tmpm366_fuart.c
/**
 *******************************************************************************
 * @file    tmpm366_fuart.c
 * @brief   This file provides API functions for Full UART driver.
 * @version V2.0.2.3
 * @date    2014/04/29
 * 
 * Copyright (c) 2009-2016, ARM Limited, All Rights Reserved
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "tmpm366_fuart.h"

#if defined(__TMPM366_FUART_H)
/** @addtogroup TX03_Periph_Driver
  * @{
  */

/** @defgroup FUART
  * @brief FUART driver modules
  * @{
  */

/** @defgroup FUART_Private_Defines
  * @{
  */
#define CR_UARTEN_SET                          ((uint32_t)0x00000001)
#define CR_WRITE0_BIT_MASK                     ((uint32_t)0xFFFFFF7F)

#define RSR_ERROR_MASK                         ((uint32_t)0x0000000F)
#define RSR_FERR_FLAG                          ((uint32_t)0x00000001)
#define RSR_PERR_FLAG                          ((uint32_t)0x00000002)
#define RSR_BERR_FLAG                          ((uint32_t)0x00000004)
#define RSR_OERR_FLAG                          ((uint32_t)0x00000008)

#define ECR_ERROR_CLEAR                        ((uint32_t)0x00000000)

#define FR_BUSY_FLAG                           ((uint32_t)0x00000008)

#define LCR_H_FIFO_EN_FLAG                     ((uint32_t)0x00000010)
#define FR_TX_STORAGE_MASK                     ((uint32_t)0x000000A0)
#define FR_RX_STORAGE_MASK                     ((uint32_t)0x00000050)

#define FR_TX_STORAGE_NORMAL                   ((uint32_t)0x00000000)
#define FR_TX_STORAGE_FULL                     ((uint32_t)0x00000020)
#define FR_TX_STORAGE_EMPTY                    ((uint32_t)0x00000080)
#define FR_TX_STORAGE_INVALID                  ((uint32_t)0x000000A0)

#define FR_RX_STORAGE_NORMAL                   ((uint32_t)0x00000000)
#define FR_RX_STORAGE_EMPTY                    ((uint32_t)0x00000010)
#define FR_RX_STORAGE_FULL                     ((uint32_t)0x00000040)
#define FR_RX_STORAGE_INVALID                  ((uint32_t)0x00000050)

#define LCR_H_WLEN_MASK                        ((uint32_t)0xFFFFFF9F)
#define LCR_H_STP2_MASK                        ((uint32_t)0xFFFFFFF7)
#define LCR_H_PARITY_MASK                      ((uint32_t)0xFFFFFF79)
#define CR_FLOW_CTRL_MASK                      ((uint32_t)0x00000F00)
#define CR_MODE_MASK                           ((uint32_t)0x0000CC00)

#define CR_SIRLP_MASK                          ((uint32_t)0xFFFFFFFB)

#define CR_UARTEN_MASK                         ((uint32_t)0x00000001)
#define CR_SIREN_SET                           ((uint32_t)0x00000002)
#define CR_SIREN_CLEAR                         ((uint32_t)0xFFFFFFFD)

#define FUART_INT_BITS                         ((uint32_t)0x000007FF)

#define DMACR_DMAONERR_CLEAR                   ((uint32_t)0x00000003)
#define DMACR_DMAONERR_SET                     ((uint32_t)0x00000004)

#define DMACR_TXDMAE_CLEAR                     ((uint32_t)0x00000005)
#define DMACR_TXDMAE_SET                       ((uint32_t)0x00000002)
#define DMACR_RXDMAE_CLEAR                     ((uint32_t)0x00000006)
#define DMACR_RXDMAE_SET                       ((uint32_t)0x00000001)

#define FR_MODEM_STATUS_MASK                   ((uint32_t)0x00000107)
#define CR_MODEM_STATUS_MASK                   ((uint32_t)0x00000C00)

/** @} */
/* End of group FUART_Private_Defines */

/** @defgroup FUART_Private_FunctionPrototypes
  * @{
  */

/** @} */
/* End of group FUART_Private_FunctionPrototypes */

/** @defgroup FUART_Private_Functions
  * @{
  */

/** @} */
/* End of group FUART_Private_Functions */

/** @defgroup FUART_Exported_Functions
  * @{
  */

/**
  * @brief  Enable the specified Full UART channel.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART0.
  * @retval None
  */
void FUART_Enable(TSB_FUART_TypeDef * FUARTx)
{

    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));

    TSB_UART_CR_UARTEN = ENABLE;
}

/**
  * @brief  Disable the specified Full UART channel.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART0.
  * @retval None
  */
void FUART_Disable(TSB_FUART_TypeDef * FUARTx)
{
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));

    TSB_UART_CR_UARTEN = DISABLE;
}

/**
  * @brief  Get received data from the specified Full UART channel.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART0.
  * @retval The data received from FUARTx
  */
uint32_t FUART_GetRxData(TSB_FUART_TypeDef * FUARTx)
{
    uint32_t retval = 0U;
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));

    /* Return received data */
    retval = FUARTx->DR & 0xFFU;

    return retval;
}

/**
  * @brief  Set data to be sent and start transmitting via the specified Full UART channel.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART0.
  * @param  Data: The data to be sent.
  *   The Data range is 0x00 to 0xFF.
  * @retval None
  */
void FUART_SetTxData(TSB_FUART_TypeDef * FUARTx, uint32_t Data)
{
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));
    assert_param(IS_FUART_DATA(Data));

    FUARTx->DR = Data & 0xFFU;
}

/**
  * @brief  Get receive error status.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART0.
  * @retval The error flag.
  *   The value returned can be one of the followings:
  *   FUART_NO_ERR, FUART_OVERRUN, FUART_PARITY_ERR, 
  *   FUART_FRAMING_ERR, FUART_BREAK_ERR, FUART_ERRS.
  */
FUART_Err FUART_GetErrStatus(TSB_FUART_TypeDef * FUARTx)
{
    FUART_Err retval = FUART_NO_ERR;
    uint32_t tmp = 0U;

    assert_param(IS_FUART_PERIPH(FUARTx));

