ARMmbed/DAPLink/source/hic_hal/toshiba/tmpm366/driver/src/tmpm366_fuart.c
    tmp &= LCR_H_STP2_MASK;
    tmp |= InitStruct->StopBits;

    tmp &= LCR_H_PARITY_MASK;
    tmp |= InitStruct->Parity;

    FUARTx->LCR_H = tmp;        /* Set DataBits, StopBits, Parity */

    tmp = FUARTx->CR;

    tmp &= CR_FLOW_CTRL_MASK;
    tmp |= InitStruct->FlowCtrl;

    tmp &= CR_MODE_MASK;
    tmp |= InitStruct->Mode;

    FUARTx->CR = tmp;           /* Set Flow Control, Mode */
}

/**
  * @brief  Enable the transmit and receive FIFO.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART0.
  * @retval None
  */
void FUART_EnableFIFO(TSB_FUART_TypeDef * FUARTx)
{
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));

    TSB_UART_LCR_H_FEN = ENABLE;
}

/**
  * @brief  Disable the transmit and receive FIFO and the mode will be changed to character mode.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART0.
  * @retval None
  */
void FUART_DisableFIFO(TSB_FUART_TypeDef * FUARTx)
{
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));

    TSB_UART_LCR_H_FEN = DISABLE;
}

/**
  * @brief  Generate the break condition for Full UART.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART0.
  * @param  NewState: New state of the FUART Send break.
  *    This parameter can be ENABLE or DISABLE.
  * @retval None
  */
void FUART_SetSendBreak(TSB_FUART_TypeDef * FUARTx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    TSB_UART_LCR_H_BRK = NewState;
}

/**
  * @brief  Select IrDA encoding mode for transmitting 0 bits.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART0.
  * @param  Mode: IrDA encoding mode select for transmitting 0 bits.
  *   This parameter can be one of the following values:
  *   FUART_IRDA_3_16_BIT_PERIOD_MODE
  *   FUART_IRDA_3_TIMES_IRLPBAUD16_MODE  
  * @retval None
  */
void FUART_SetIrDAEncodeMode(TSB_FUART_TypeDef * FUARTx, uint32_t Mode)
{
    uint32_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));
    assert_param(IS_IRDA_ENCODE_MODE(Mode));

    /* read UARTCR register then clear bit<SIRLP> as FUART_IRDA_3_16_BIT_PERIOD_MODE */
    tmp = FUARTx->CR & CR_SIRLP_MASK;

    if (Mode == FUART_IRDA_3_TIMES_IRLPBAUD16_MODE) {
        /* Set mode as FUART_IRDA_3_TIMES_IRLPBAUD16_MODE */
        tmp |= FUART_IRDA_3_TIMES_IRLPBAUD16_MODE;
    } else {
        /* do nothing */
    }

    tmp &= CR_WRITE0_BIT_MASK;  /* UARTCR bit 7 write as zero */
    FUARTx->CR = tmp;
}

/**
  * @brief  Enable the IrDA circuit
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART0.
  * @retval The result of enabling IrDA circuit
  *   This parameter can be one of the following values:
  *   SUCCESS: Enable IrDA circuit successfully.
  *   ERROR: The UART channel is disabled, can not enable IrDA circuit.
  */
Result FUART_EnableIrDA(TSB_FUART_TypeDef * FUARTx)
{
    uint32_t tmp = 0U;
    Result retval = SUCCESS;

    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));

    /* Get UARTCR<UARTEN> to check if Full UART channel is enabled */
    tmp = FUARTx->CR & CR_UARTEN_MASK;

    if (tmp == CR_UARTEN_SET) { /* Full UART is enabled */
        tmp = FUARTx->CR | CR_SIREN_SET;
        tmp &= CR_WRITE0_BIT_MASK;      /* UARTCR bit 7 write as zero */
        FUARTx->CR = tmp;
    } else {                    /* Full UART is disabled */
        retval = ERROR;         /* Can not enable IrDA circuit */
    }

    return retval;
}

/**
  * @brief  Disable the IrDA circuit
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART0.
  * @retval None
  */
void FUART_DisableIrDA(TSB_FUART_TypeDef * FUARTx)
{
    uint32_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));

    /* Get UARTCR<UARTEN> to check if Full UART channel is enabled */
    tmp = FUARTx->CR & CR_UARTEN_MASK;

    if (tmp == CR_UARTEN_SET) { /* Full UART is enabled */
        tmp = FUARTx->CR & CR_SIREN_CLEAR;
        tmp &= CR_WRITE0_BIT_MASK;      /* UARTCR bit 7 write as zero */
        FUARTx->CR = tmp;
    } else {                    /* Full UART is disabled */
        /* do nothing */
    }
}

/**
  * @brief  Set the Receive and Transmit interrupt FIFO level.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART0.
  * @param  RxLevel: Receive interrupt FIFO level.
  *   This parameter can be one of the following values:
  *   FUART_RX_FIFO_LEVEL_4:  The data in Receive FIFO become >= 4 words
  *   FUART_RX_FIFO_LEVEL_8:  The data in Receive FIFO become >= 8 words
  *   FUART_RX_FIFO_LEVEL_16: The data in Receive FIFO become >= 16 words
  *   FUART_RX_FIFO_LEVEL_24: The data in Receive FIFO become >= 24 words
  *   FUART_RX_FIFO_LEVEL_28: The data in Receive FIFO become >= 28 words
  * @param  TxLevel: Transmit interrupt FIFO level.
  *   This parameter can be one of the following values:
  *   FUART_TX_FIFO_LEVEL_4:  The data in Transmit FIFO become <= 4 words
  *   FUART_TX_FIFO_LEVEL_8:  The data in Transmit FIFO become <= 8 words
  *   FUART_TX_FIFO_LEVEL_16: The data in Transmit FIFO become <= 16 words
  *   FUART_TX_FIFO_LEVEL_24: The data in Transmit FIFO become <= 24 words
  *   FUART_TX_FIFO_LEVEL_28: The data in Transmit FIFO become <= 28 words
  * @retval None
  */
void FUART_SetINTFIFOLevel(TSB_FUART_TypeDef * FUARTx, uint32_t RxLevel, uint32_t TxLevel)
{
    uint32_t tmp = 0U;
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));
    assert_param(IS_FUART_RX_FIFO_LEVEL(RxLevel));
    assert_param(IS_FUART_TX_FIFO_LEVEL(TxLevel));

    tmp = RxLevel | TxLevel;

    FUARTx->IFLS = tmp;
}

/**
  * @brief  Mask(Enable) interrupt source of the specified channel.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART0.
  * @param  IntMaskSrc: The interrupt source to be masked(enabled).
  * @retval None
  */
void FUART_SetINTMask(TSB_FUART_TypeDef * FUARTx, uint32_t IntMaskSrc)
{
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));
    assert_param(IS_INT_MASK_SRC(IntMaskSrc));

    FUARTx->IMSC = IntMaskSrc;
}

/**
  * @brief  Get the mask(enable) setting for each interrupt source.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART0.
  * @retval A data with union that it indicates the mask setting.
  */
FUART_INTStatus FUART_GetINTMask(TSB_FUART_TypeDef * FUARTx)
{
    FUART_INTStatus retval = { 0U };
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));

