ARMmbed/DAPLink/source/hic_hal/toshiba/tmpm366/driver/src/tmpm366_fuart.c
    retval.All = FUARTx->IMSC & FUART_INT_BITS;
    return retval;
}

/**
  * @brief  Get the raw interrupt status of the specified Full UART channel.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART0.
  * @retval A data with union that indicates the raw interrupt status.
  */
FUART_INTStatus FUART_GetRawINTStatus(TSB_FUART_TypeDef * FUARTx)
{
    FUART_INTStatus retval = { 0U };
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));

    retval.All = FUARTx->RIS & FUART_INT_BITS;
    return retval;
}

/**
  * @brief  Get the masked interrupt status of the specified Full UART channel.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART0.
  * @retval A data with union that indicates the masked interrupt status.
  */
FUART_INTStatus FUART_GetMaskedINTStatus(TSB_FUART_TypeDef * FUARTx)
{
    FUART_INTStatus retval = { 0U };
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));

    retval.All = FUARTx->MIS & FUART_INT_BITS;
    return retval;
}

/**
  * @brief  Clear the interrupts of the specified Full UART channel.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART0.
  * @param  INTStatus: A data with union that indicates the interrupts to be cleared.
  * @retval None
  */
void FUART_ClearINT(TSB_FUART_TypeDef * FUARTx, FUART_INTStatus INTStatus)
{
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));
    assert_param(IS_INT_MASK_SRC(INTStatus.All));

    FUARTx->ICR = INTStatus.All;
}

/**
  * @brief  Enable or disable the DMA receive request output 
  *         on assertion of a UART error interrupt.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART0.
  * @param  NewState: New state of the DMA receive request output 
  *         on assertion of a UART error interrupt.
  *   This parameter can be ENABLE or DISABLE.
  * @retval None
  */
void FUART_SetDMAOnErr(TSB_FUART_TypeDef * FUARTx, FunctionalState NewState)
{
    uint32_t tmp = 0U;
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    /* read UARTDMACR then clear bit2 as disable it */
    tmp = FUARTx->DMACR & DMACR_DMAONERR_CLEAR;

    if (NewState == ENABLE) {
        /* if enable, Set bit2: UARTDMACR<DMAONERR> */
        tmp |= DMACR_DMAONERR_SET;
    } else {
        /* do nothing */
    }

    FUARTx->DMACR = tmp;
}

/**
  * @brief  Enable or Disable the Transmit FIFO DMA or Receive FIFO DMA.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART0.
  * @param Direction: The direction of Full UART.
  *   This parameter can be one of the following values:
  *   FUART_RX, FUART_TX
  * @param  NewState: New state of Transmit or Receive FIFO DMA.
  *   This parameter can be ENABLE or DISABLE.
  * @retval None
  */
void FUART_SetFIFODMA(TSB_FUART_TypeDef * FUARTx, FUART_Direction Direction,
                      FunctionalState NewState)
{
    uint32_t tmp = 0U;
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));
    assert_param(IS_FUART_DIRECTION(Direction));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (Direction == FUART_TX) {        /* Cofigure Transmit FIFO DMA */
        tmp = FUARTx->DMACR & DMACR_TXDMAE_CLEAR;
        if (NewState == ENABLE) {
            /* if enable, Set bit1: UARTDMACR<TXDMAE> */
            tmp |= DMACR_TXDMAE_SET;
        } else {
            /* do nothing */
        }
    } else {                    /* Cofigure Receive FIFO DMA */
        tmp = FUARTx->DMACR & DMACR_RXDMAE_CLEAR;
        if (NewState == ENABLE) {
            /* if enable, Set bit0: UARTDMACR<RXDMAE> */
            tmp |= DMACR_RXDMAE_SET;
        } else {
            /* do nothing */
        }
    }

    FUARTx->DMACR = tmp;
}

/**
  * @brief  Get All the Modem Status, include: CTS, DSR, DCD, RIN, DTR, and RTS.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART0.
  * @retval A data with union that indicates all the modem status.
  */
FUART_AllModemStatus FUART_GetModemStatus(TSB_FUART_TypeDef * FUARTx)
{
    uint32_t tmpfr = 0U;
    uint32_t tmpcr = 0U;
    FUART_AllModemStatus retval = { 0U };
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));

    tmpfr = FUARTx->FR & FR_MODEM_STATUS_MASK;  /* Get RI, DCD, DSR status */
    tmpcr = FUARTx->CR & CR_MODEM_STATUS_MASK;  /* Get RTS,DTS status */

    tmpfr |= tmpcr;
    retval.All = tmpfr;
    return retval;
}

/**
  * @brief  Set the Full UART RTS(Request To Send) modem status output.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART0.
  * @param  Status: RTS modem status output.
  *   This parameter can be one of the following values:
  *   FUART_MODEM_STATUS_0: The modem status output is 0
  *   FUART_MODEM_STATUS_1: The modem status output is 1
  * @retval None
  */
void FUART_SetRTSStatus(TSB_FUART_TypeDef * FUARTx, FUART_ModemStatus Status)
{
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));
    assert_param(IS_MODEM_STATUS(Status));

    TSB_UART_CR_RTS = Status;
}

/**
  * @brief  Set the Full UART DTR(Data Transmit Ready) modem status output.
  * @param  FUARTx: Select the Full UART channel.
  *   This parameter can be one of the following values:
  *   FUART0.
  * @param  Status: DTR modem status output.
  *   This parameter can be one of the following values:
  *   FUART_MODEM_STATUS_0: The modem status output is 0
  *   FUART_MODEM_STATUS_1: The modem status output is 1
  * @retval None
  */
void FUART_SetDTRStatus(TSB_FUART_TypeDef * FUARTx, FUART_ModemStatus Status)
{
    /* Check the parameters */
    assert_param(IS_FUART_PERIPH(FUARTx));
    assert_param(IS_MODEM_STATUS(Status));

    TSB_UART_CR_DTR = Status;
}

/** @} */
/* End of group FUART_Exported_Functions */

/** @} */
/* End of group FUART */

/** @} */
/* End of group TX03_Periph_Driver */

#endif                          /* defined(__TMPM366_FUART_H) */
